In [ ]:
!pip install pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = [10, 20, 30, 40, 50]

series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])

In [4]:
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
type(series)

pandas.core.series.Series

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'London', 'Tokyo', 'Paris'],
    'Salary': [70000, 80000, 90000, 75000]
}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30    London   80000
2  Charlie   35     Tokyo   90000
3    Diana   28     Paris   75000

In [9]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(df.Name)

pandas.core.series.Series

In [16]:
df[[ "Age", "City","Name"]]

   Age      City     Name
0   25  New York    Alice
1   30    London      Bob
2   35     Tokyo  Charlie
3   28     Paris    Diana

In [17]:
np.random.seed(42)
df = pd.DataFrame({
    'A': np.random.randn(100),
    'B': np.random.randint(1, 10, 100),
    'C': np.random.choice(['X', 'Y', 'Z'], 100),
    'D': pd.date_range('2023-01-01', periods=100, freq='D'),
    'E': np.random.randn(100) * 100
})

In [20]:
df.head(10)

          A  B  C          D           E
0  0.496714  9  Y 2023-01-01   23.229616
1 -0.138264  5  Y 2023-01-02   17.618092
2  0.647689  1  Y 2023-01-03 -115.256537
3  1.523030  3  Y 2023-01-04 -150.076839
4 -0.234153  8  Z 2023-01-05   16.502280
5 -0.234137  6  X 2023-01-06  -85.592892
6  1.579213  8  X 2023-01-07   -3.963614
7  0.767435  9  X 2023-01-08  -53.466274
8 -0.469474  4  X 2023-01-09 -178.849650
9  0.542560  1  Y 2023-01-10   35.730454

In [22]:
df.tail(15)

           A  B  C          D           E
85 -0.501757  8  Z 2023-03-27 -122.057010
86  0.915402  1  X 2023-03-28  -66.920273
87  0.328751  8  Y 2023-03-29  116.193732
88 -0.529760  4  Z 2023-03-30  155.285978
89  0.513267  1  Y 2023-03-31  -43.951788
90  0.097078  8  Z 2023-04-01  -40.791535
91  0.968645  4  Y 2023-04-02   26.162306
92 -0.702053  6  X 2023-04-03    1.214651
93 -0.327662  8  X 2023-04-04   93.093408
94 -0.392108  4  Y 2023-04-05  -52.318809
95 -1.463515  3  Z 2023-04-06   94.914299
96  0.296120  9  X 2023-04-07  -23.922480
97  0.261055  3  X 2023-04-08   85.397471
98  0.005113  9  X 2023-04-09  -27.104046
99 -0.234587  2  Y 2023-04-10  -61.309468

In [30]:
df.sample(5)

           A  B  C          D           E
31  1.852278  6  Y 2023-02-01  -31.784691
60 -0.479174  2  X 2023-03-02   64.716270
51 -0.385082  3  Y 2023-02-21  132.326381
14 -1.724918  3  X 2023-01-15  156.038014
80 -0.219672  3  X 2023-03-22  -62.970086

In [31]:
df.shape

(100, 5)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       100 non-null    float64
 1   B       100 non-null    int32
 2   C       100 non-null    object
 3   D       100 non-null    datetime64[ns]
 4   E       100 non-null    float64
dtypes: datetime64[ns](1), float64(2), int32(1), object(1)
memory usage: 3.6+ KB

In [33]:
df.dtypes

A           float64
B             int32
C            object
D    datetime64[ns]
E           float64
dtype: object

In [34]:
df.describe()

                A           B                    D           E
count  100.000000  100.000000                  100  100.000000
mean    -0.103847    4.730000  2023-02-19 12:00:00    8.073564
min     -2.619745    1.000000  2023-01-01 00:00:00 -199.496157
25%     -0.600906    2.000000  2023-01-25 18:00:00  -61.360443
50%     -0.126956    4.000000  2023-02-19 12:00:00    3.682609
75%      0.405952    7.000000  2023-03-16 06:00:00   85.966970
max      1.852278    9.000000  2023-04-10 00:00:00  238.903596
std      0.908168    2.733463                  NaN  101.447471

In [35]:
df.describe(include="all")

                 A           B    C                    D           E
count   100.000000  100.000000  100                  100  100.000000
unique         NaN         NaN    3                  NaN         NaN
top            NaN         NaN    X                  NaN         NaN
freq           NaN         NaN   36                  NaN         NaN
mean     -0.103847    4.730000  NaN  2023-02-19 12:00:00    8.073564
min      -2.619745    1.000000  NaN  2023-01-01 00:00:00 -199.496157
25%      -0.600906    2.000000  NaN  2023-01-25 18:00:00  -61.360443
50%      -0.126956    4.000000  NaN  2023-02-19 12:00:00    3.682609
75%       0.405952    7.000000  NaN  2023-03-16 06:00:00   85.966970
max       1.852278    9.000000  NaN  2023-04-10 00:00:00  238.903596
std       0.908168    2.733463  NaN                  NaN  101.447471

In [36]:
df.describe(include="all").T

,count,unique,top,freq,mean,min,25%,50%,75%,max,std
A,100.0,NaN,NaN,NaN,-0.103847,-2.619745,-0.600906,-0.126956,0.405952,1.852278,0.908168
B,100.0,NaN,NaN,NaN,4.73,1.0,2.0,4.0,7.0,9.0,2.733463
C,100,3,X,36,NaN,NaN,NaN,NaN,NaN,NaN,NaN
D,100,NaN,NaN,NaN,2023-02-19 12:00:00,2023-01-01 00:00:00,2023-01-25 18:00:00,2023-02-19 12:00:00,2023-03-16 06:00:00,2023-04-10 00:00:00,NaN
E,100.0,NaN,NaN,NaN,8.073564,-199.496157,-61.360443,3.682609,85.96697,238.903596,101.447471

In [39]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
A,0.496714,-0.138264,0.647689,1.52303,-0.234153,-0.234137,1.579213,0.767435,-0.469474,0.54256,...,0.097078,0.968645,-0.702053,-0.327662,-0.392108,-1.463515,0.29612,0.261055,0.005113,-0.234587
B,9,5,1,3,8,6,8,9,4,1,...,8,4,6,8,4,3,9,3,9,2
C,Y,Y,Y,Y,Z,X,X,X,X,Y,...,Z,Y,X,X,Y,Z,X,X,X,Y
D,2023-01-01 00:00:00,2023-01-02 00:00:00,2023-01-03 00:00:00,2023-01-04 00:00:00,2023-01-05 00:00:00,2023-01-06 00:00:00,2023-01-07 00:00:00,2023-01-08 00:00:00,2023-01-09 00:00:00,2023-01-10 00:00:00,...,2023-04-01 00:00:00,2023-04-02 00:00:00,2023-04-03 00:00:00,2023-04-04 00:00:00,2023-04-05 00:00:00,2023-04-06 00:00:00,2023-04-07 00:00:00,2023-04-08 00:00:00,2023-04-09 00:00:00,2023-04-10 00:00:00
E,23.229616,17.618092,-115.256537,-150.076839,16.50228,-85.592892,-3.963614,-53.466274,-178.84965,35.730454,...,-40.791535,26.162306,1.214651,93.093408,-52.318809,94.914299,-23.92248,85.397471,-27.104046,-61.309468

In [44]:
df["C"].unique()

array(['Y', 'Z', 'X'], dtype=object)

In [45]:
df["C"].value_counts()

C
X    36
Y    35
Z    29
Name: count, dtype: int64

In [46]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [47]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [48]:
print(df['A'].mean())       # Mean
print(df['A'].median())     # Median
print(df['A'].mode())       # Mode
print(df['A'].std())        # Standard deviation
print(df['A'].var())        # Variance
print(df['A'].min())        # Minimum
print(df['A'].max())        # Maximum
print(df['A'].quantile(0.25))  # 25th percentile

-0.10384651739409384
-0.1269562917797126
0    -2.619745
1    -1.987569
2    -1.959670
3    -1.913280
4    -1.763040
        ...
95    1.523030
96    1.538037
97    1.564644
98    1.579213
99    1.852278
Name: A, Length: 100, dtype: float64
0.9081684280078008
0.8247698936301602
-2.6197451040897444
1.8522781845089378
-0.6009056704964529

In [49]:
print(df['A'].mean())       # Mean

-0.10384651739409384

In [50]:
print(df['A'].mode())

0    -2.619745
1    -1.987569
2    -1.959670
3    -1.913280
4    -1.763040
        ...
95    1.523030
96    1.538037
97    1.564644
98    1.579213
99    1.852278
Name: A, Length: 100, dtype: float64

In [51]:
print(df['A'].min())

-2.6197451040897444

In [52]:
df[["A", "B", "E"]].mean()

A   -0.103847
B    4.730000
E    8.073564
dtype: float64

In [53]:
print(df['C'].nunique())         # Number of unique values

3

In [57]:
df.isnull().sum() # Count of missing values

A    0
B    0
C    0
D    0
E    0
dtype: int64

In [58]:
df.isna().sum()

A    0
B    0
C    0
D    0
E    0
dtype: int64

In [59]:
print(df.notnull().sum())

A    100
B    100
C    100
D    100
E    100
dtype: int64

In [67]:
df.loc[10:50:5,["A","B","C"]]

           A  B  C
10 -0.463418  1  X
15 -0.562288  1  Z
20  1.465649  1  Y
25  0.110923  5  Z
30 -0.601707  5  X
35 -1.220844  8  X
40  0.738467  4  X
45 -0.719844  9  Y
50  0.324084  3  X

In [69]:
df.iloc[10:90:9, 2:6:2]

    C           E
10  X  -41.453181
19  Y  184.341376
28  Z  -77.181908
37  Z  165.135099
46  Z -129.494247
55  X  234.799693
64  Y  -61.513368
73  Z  -46.452975
82  X   55.173701

In [72]:
df = pd.read_csv("F:\\05. sales_data_final.csv")

In [73]:
df1 = df.copy()

In [75]:
df1.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,category,sub_category,product_name,sales,quantity,discount,profit,shipping_cost,order_priority,year
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,Office Supplies,Storage,"Tenex Lockers, Blue",408,2,0.0,106.140,35.46,Medium,2011
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Office Supplies,Supplies,"Acme Trimmer, High Speed",120,3,0.1,36.036,9.72,Medium,2011
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,Office Supplies,Storage,"Tenex Box, Single Width",66,4,0.0,29.640,8.17,High,2011
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,Office Supplies,Paper,"Enermax Note Cards, Premium",45,3,0.5,-26.055,4.82,High,2011
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Furniture,Furnishings,"Eldon Light Bulb, Duo Pack",114,5,0.1,37.770,4.70,Medium,2011

In [76]:
df1.columns

Index(['order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_name',
       'segment', 'state', 'country', 'market', 'region', 'product_id',
       'category', 'sub_category', 'product_name', 'sales', 'quantity',
       'discount', 'profit', 'shipping_cost', 'order_priority', 'year'],
      dtype='object')

In [77]:
df1.isnull().sum()

order_id          0
order_date        0
ship_date         0
ship_mode         0
customer_name     0
segment           0
state             0
country           0
market            0
region            0
product_id        0
category          0
sub_category      0
product_name      0
sales             0
quantity          0
discount          0
profit            0
shipping_cost     0
order_priority    0
year              0
dtype: int64

In [78]:
df1.dtypes

order_id           object
order_date         object
ship_date          object
ship_mode          object
customer_name      object
segment            object
state              object
country            object
market             object
region             object
product_id         object
category           object
sub_category       object
product_name       object
sales              object
quantity            int64
discount          float64
profit            float64
shipping_cost     float64
order_priority     object
year                int64
dtype: object

In [80]:
df1.duplicated().sum()

0

In [83]:
df1.describe(include= "all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
order_id,51290,25035,CA-2014-100111,14,NaN,NaN,NaN,NaN,NaN,NaN,NaN
order_date,51290,1430,6/18/2014,135,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ship_date,51290,1464,11/22/2014,130,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ship_mode,51290,4,Standard Class,30775,NaN,NaN,NaN,NaN,NaN,NaN,NaN
customer_name,51290,795,Muhammed Yedwab,108,NaN,NaN,NaN,NaN,NaN,NaN,NaN
segment,51290,3,Consumer,26518,NaN,NaN,NaN,NaN,NaN,NaN,NaN
state,51290,1094,California,2001,NaN,NaN,NaN,NaN,NaN,NaN,NaN
country,51290,147,United States,9994,NaN,NaN,NaN,NaN,NaN,NaN,NaN
market,51290,7,APAC,11002,NaN,NaN,NaN,NaN,NaN,NaN,NaN
region,51290,13,Central,11117,NaN,NaN,NaN,NaN,NaN,NaN,NaN
product_id,51290,10292,OFF-AR-10003651,35,NaN,NaN,NaN,NaN,NaN,NaN,NaN
category,51290,3,Office Supplies,31273,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sub_category,51290,17,Binders,6152,NaN,NaN,NaN,NaN,NaN,NaN,NaN
product_name,51290,3788,Staples,227,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sales,51290,2246,13,589,NaN,NaN,NaN,NaN,NaN,NaN,NaN
quantity,51290.0,NaN,NaN,NaN,3.476545,2.278766,1.0,2.0,3.0,5.0,14.0
discount,51290.0,NaN,NaN,NaN,0.142908,0.21228,0.0,0.0,0.0,0.2,0.85
profit,51290.0,NaN,NaN,NaN,28.64174,174.424113,-6599.978,0.0,9.24,36.81,8399.976
shipping_cost,51290.0,NaN,NaN,NaN,26.375915,57.296804,0.0,2.61,7.79,24.45,933.57
order_priority,51290,4,Medium,29433,NaN,NaN,NaN,NaN,NaN,NaN,NaN
year,51290.0,NaN,NaN,NaN,2012.777208,1.098931,2011.0,2012.0,2013.0,2014.0,2014.0

In [84]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana','Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 35, 28, 18, 23, 40, 35],
    'City': ['New York', 'London', 'Tokyo', 'Paris','New York', 'London', 'Tokyo', 'Paris'],
    'Salary': [70000, 80000, 90000, 75000, 30000, 40000, 90000, 15000]
}

In [85]:
df = pd.DataFrame(data)

In [86]:
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30    London   80000
2  Charlie   35     Tokyo   90000
3    Diana   28     Paris   75000
4    Alice   18  New York   30000
5      Bob   23    London   40000
6  Charlie   40     Tokyo   90000
7    Diana   35     Paris   15000

In [88]:
df[df['Age'] > 30]

      Name  Age   City  Salary
2  Charlie   35  Tokyo   90000
6  Charlie   40  Tokyo   90000
7    Diana   35  Paris   15000

In [89]:
df[(df['Age'] > 25) & (df['City'] == 'Paris')]

    Name  Age   City  Salary
3  Diana   28  Paris   75000
7  Diana   35  Paris   15000

In [90]:
df[(df['Age'] > 25) | (df['City'] == 'Paris')]

      Name  Age    City  Salary
1      Bob   30  London   80000
2  Charlie   35   Tokyo   90000
3    Diana   28   Paris   75000
6  Charlie   40   Tokyo   90000
7    Diana   35   Paris   15000

In [92]:
# Using isin() method
df[df['City'].isin(["London"])]

  Name  Age    City  Salary
1  Bob   30  London   80000
5  Bob   23  London   40000

In [96]:
# String operations in boolean indexing
print(df[df['Name'].str.contains('A')])    # Names containing 'A'

    Name  Age      City  Salary
0  Alice   25  New York   70000
4  Alice   18  New York   30000

In [97]:
print(df[df['Name'].str.startswith('B')])  # Names starting with 'A'

  Name  Age    City  Salary
1  Bob   30  London   80000
5  Bob   23  London   40000

In [98]:
# Create DataFrame with missing values
data_with_na = {
    'A': [1, 2, np.nan, 4, 5,np.nan],
    'B': [np.nan, 2, 3, 4, np.nan, 55],
    'C': ['x', 'y', None, 'w', 'z', None]
}
df_na = pd.DataFrame(data_with_na)

In [99]:
df_na

     A     B     C
0  1.0   NaN     x
1  2.0   2.0     y
2  NaN   3.0  None
3  4.0   4.0     w
4  5.0   NaN     z
5  NaN  55.0  None

In [100]:
df_na.isna().sum()

A    2
B    2
C    2
dtype: int64

In [101]:
df_na.dropna()

     A    B  C
1  2.0  2.0  y
3  4.0  4.0  w

In [102]:
df_na.dropna(thresh=2)

     A    B  C
0  1.0  NaN  x
1  2.0  2.0  y
3  4.0  4.0  w
4  5.0  NaN  z

In [103]:
df_na.fillna(4)

     A     B  C
0  1.0   4.0  x
1  2.0   2.0  y
2  4.0   3.0  4
3  4.0   4.0  w
4  5.0   4.0  z
5  4.0  55.0  4

In [104]:
df_na["A"].mean()

3.0

In [107]:
df_na["A"] = df_na["A"].fillna(df_na["A"].mean())

In [108]:
df_na

     A     B     C
0  1.0   NaN     x
1  2.0   2.0     y
2  3.0   3.0  None
3  4.0   4.0     w
4  5.0   NaN     z
5  3.0  55.0  None

In [110]:
df_na.drop("C", axis=1)

     A     B
0  1.0   NaN
1  2.0   2.0
2  3.0   3.0
3  4.0   4.0
4  5.0   NaN
5  3.0  55.0

In [111]:
df_na

     A     B     C
0  1.0   NaN     x
1  2.0   2.0     y
2  3.0   3.0  None
3  4.0   4.0     w
4  5.0   NaN     z
5  3.0  55.0  None

In [112]:
df_na.drop("C", axis=1, inplace= True)

In [113]:
df_na

     A     B
0  1.0   NaN
1  2.0   2.0
2  3.0   3.0
3  4.0   4.0
4  5.0   NaN
5  3.0  55.0

In [114]:
df_na.drop_duplicates()

     A     B
0  1.0   NaN
1  2.0   2.0
2  3.0   3.0
3  4.0   4.0
4  5.0   NaN
5  3.0  55.0

In [115]:
df_types = pd.DataFrame({
    'integers': ['1', '2', '3', '4'],
    'floats': ['1.1', '2.2', '3.3', '4.4'],
    'dates': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04'],
    'categories': ['A', 'B', 'A', 'C']
})

In [116]:
df_types

  integers floats       dates categories
0        1    1.1  2023-01-01          A
1        2    2.2  2023-01-02          B
2        3    3.3  2023-01-03          A
3        4    4.4  2023-01-04          C

In [121]:
df_types.dtypes

integers        int32
floats        float64
dates          object
categories     object
dtype: object

In [118]:
df_types["integers"]= df_types["integers"].astype("int")

In [120]:
df_types["floats"]= df_types["floats"].astype("float")

In [122]:
df_mixed = pd.DataFrame({'col': ['1', '2', 'three', '4']})

In [123]:
df_mixed

     col
0      1
1      2
2  three
3      4

In [ ]:
df_mixed['col_numeric'] = pd.to_numeric(df_mixed['col'], errors='coerce')  # NaN for non-numeric
print(df_mixed)